GenevGitHub/simple_peripheral_cc2640r2lp_app-New-Version-/Application/motorControl.c
/******************************************************************************

 @file  motorControl.c

 @brief This file contains the Code of motor control interfacing


 *****************************************************************************/

/*********************************************************************
 * INCLUDES
 */
#include <ti/drivers/I2C.h>
#include <ti/drivers/NVS.h>
#include <ti/drivers/GPIO.h>
#include "UDHAL/UDHAL.h"
#include "STM32MCP/STM32MCP.h"
#include "Controller.h"
#include "Dashboard.h"
#include "Battery.h"
#include "motorControl.h"
#include "util.h"
#include "periodicCommunication.h"
#include "simple_peripheral.h"
#include "brakeAndThrottle.h"
#include "ledControl.h"
#include "lightControl.h"
#include "buzzerControl.h"
#include "powerOnTime.h"
#include "dataAnalysis.h"
#include "singleButton/singleButton.h"
#include "peripheral.h"
#include "TSL2561/TSL2561.h"
#include <Board.h>

#include "generalPurposeTimer.h"

/*Hardware Driver*/
#include <ti/devices/DeviceFamily.h>
#include DeviceFamily_constructPath(inc/hw_prcm.h)
#include DeviceFamily_constructPath(driverlib/sys_ctrl.h)
#include <ti/devices/cc26x0r2/driverlib/cpu.h>

#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerCC26XX.h>

#include <ti/drivers/PIN.h>
#include <ti/drivers/pin/PINCC26XX.h>

#include <ti/sysbios/knl/Semaphore.h>
#include <ti/sysbios/BIOS.h>
/*********************************************************************
 * CONSTANTS
 */
/*********************************************************************
 * GLOBAL VARIABLES
 */
/*********************************************************************
 * LOCAL VARIABLES
 */
static uint8_t motorcontrol_i2cOpenStatus = 0;
static simplePeripheral_bleCBs_t *motorcontrol_bleCBs;
static uint8_t motorControl_getGAPRole_taskCreate_flag = 0;
bool powerOn = 1;            // How does power on and power off work? powerOn Should be 1
MCUD_t MCUDArray = {LEVEL45, 3000, 0, 20, 20, 0};     // MCUD_t MCUDArray {voltage, current, rpm, hsttemp, motortemp, hf_count} initial values are zeros.  Non zero values are dummy initial values for debugging
MCUD_t *ptrMCUDArray = &MCUDArray;
uint16_t brakeAndThrottle_rpm;
uint16_t *ptrbrakeAndThrottle_rpm = &brakeAndThrottle_rpm;
//uint16_t throttle_Percent;

/**********************************************************************
 *  Local functions
 */
static void motorcontrol_processGetRegisterFrameMsg(uint8_t *txPayload, uint8_t txPayloadLength, uint8_t *rxPayload, uint8_t rxPayloadLength);

static void motorcontrol_rxMsgCb(uint8_t *rxMsg, STM32MCP_txMsgNode_t *STM32MCP_txMsgNode);
static void motorcontrol_exMsgCb(uint8_t exceptionCode);
static void motorcontrol_erMsgCb(uint8_t errorCode);

static void motorcontrol_brakeAndThrottleCB(uint16_t allowableSpeed, uint16_t IQValue, uint8_t errorMsg);
static void motorcontrol_controllerCB(uint8_t paramID);
static void motorcontrol_dashboardCB(uint8_t paramID);
static void motorcontrol_singleButtonCB(uint8_t messageID);
static void motorcontrol_getGAPROLE(void);

//extern void motorcontrol_setGatt(uint16_t serviceUUID, uint8_t characteristics, uint8_t payloadLength, uint8_t* payload);
/*********************************************************************
 * TYPEDEFS
 */
static STM32MCP_CBs_t STM32MCP_CBs =
{
     motorcontrol_rxMsgCb,
     motorcontrol_exMsgCb,
     motorcontrol_erMsgCb
};

static ControllerCBs_t ControllerCBs =
{
     motorcontrol_controllerCB
};

static DashboardCBs_t DashboardCBs =
{
     motorcontrol_dashboardCB
};

static singleButtonCBs_t singleButtonCBs =
{
     motorcontrol_singleButtonCB
};

static brakeAndThrottle_CBs_t brakeAndThrottle_CBs =
{
     motorcontrol_brakeAndThrottleCB                    // brake and throttle callback -> what happens when brake & throttle interrupts
};


//static lightControl_CBs_t lightControl_CBs =
//{
//     motorcontrol_lightControlCB
//};

//static buzzerControl_CBs_t buzzerControl_CBs =
//{
//     motorcontrol_buzzerControlCB
//};

uint8_t fail = 0;
uint32_t resetSource = 0xFFFF;
uint8_t bootStatus = 0xFF;
uint8_t bootSuccess = 0x00;

uint8_t buttonPress = 0xFF;
uint8_t bootProcess = 0xFF;
uint8_t wkUpPin = 0xFF;

/*
PIN_Config WakeUp[] = {
      CC2640R2_GENEV_5X5_ID_DIO5 | PIN_INPUT_EN | PIN_PULLUP | PINCC26XX_WAKEUP_NEGEDGE,
      PIN_TERMINATE
};
*/

uint8_t Boot()
{
    /*Boot Process*/
    resetSource = SysCtrlResetSourceGet();
    if (resetSource == RSTSRC_WAKEUP_FROM_SHUTDOWN)
    {
         bootStatus = 0x01;

    }
    else if (resetSource == RSTSRC_PWR_ON)
    {
         bootStatus = 0x02;
    }
    else if (resetSource == RSTSRC_SYSRESET)
    {
        bootStatus = 0x03;
    }
    else if (resetSource == RSTSRC_PIN_RESET)
    {
        bootStatus = 0x04;
        while(bootSuccess == 0x00)
        {
            if(bootSuccess == 0x01)
            {
                break;
            }
        }
    }
    return bootStatus;
}
/*********************************************************************
 * @fn      MC_init
 *
 * @brief   Initialization function for the Motor Control Task.
 *
 * @param   none
 *
 * @return  none
 */
//uint8_t mccheck = 0;        // FOR DEBUGGING ONLY
uint8_t bootFlag = 0xFF;
void motorcontrol_init(void)
{
// Activate NVS_internal to Recall the last set of saved data in memory
//    NVS_init();
    //Obtain System Reset Source !!!
    //uint8_t event_List = PowerCC26XX_ENTERING_SHUTDOWN | PowerCC26XX_ENTERING_STANDBY | PowerCC26XX_AWAKE_STANDBY | PowerCC26XX_AWAKE_STANDBY_LATE;
    //Power_registerNotify(&powerNotifyObj, event_List, powerTransitionNotifyFxn, NULL);
    UDHAL_init();
//    mccheck = 1;        // FOR DEBUGGING ONLY

    Controller_RegisterAppCBs(&ControllerCBs);

    Dashboard_RegisterAppCBs(&DashboardCBs);

    STM32MCP_init();
    STM32MCP_registerCBs(&STM32MCP_CBs);
    STM32MCP_startCommunication();    //ACTIVATE OR DEACTIVATE

    periodicCommunication_STM32MCP_getRegisterFrame();
    dataAnalysis_motorControl(ptrMCUDArray);            // passes ptrMCUDArray to dataAnalysis.c
    brakeAndThrottle_motorControl_rpm(ptrbrakeAndThrottle_rpm);    // passes ptrbrakeAndThrottle_rpm to brakeAndThrottle.c
    periodicCommunication_start();

