GenevGitHub/simple_peripheral_cc2640r2lp_app-New-Version-/Application/motorControl.c
    dataAnalysis_init();                // Initiate data analytics

    brakeAndThrottle_init();
    brakeAndThrottle_registerCBs(&brakeAndThrottle_CBs);
    brakeAndThrottle_start();

    singleButton_init();
    singleButton_registerCBs(&singleButtonCBs);

    buzzerControl_init();               // Initiate buzzer on dashboard

    motorcontrol_i2cOpenStatus = UDHAL_getI2CStatus();
    // ************* when i2c open successfully, motorcontrol_i2cOpenStatus = 1,
    // ************* when i2c opens unsuccessfully, motorcontrol_i2cOpenStatus = 0 -> TSL2561 light sensor and Led Display are not initiated or activated
    if (motorcontrol_i2cOpenStatus == 1)
    {
         //TSL25403_init();
         TSL2561_init();
         ledControl_init();
    }

    lightControl_init( motorcontrol_i2cOpenStatus );                            // UDHAL_I2C must be initiated before lightControl_init();

    powerOnTime_init();           // merged with lightControl 20230705

    // If GAPRole_createTask initiated and called successfully, gapRole_getGAPRole_taskCreate_flag() returns 1
    motorControl_getGAPRole_taskCreate_flag = gapRole_getGAPRole_taskCreate_flag();

//    mccheck = 3;        // FOR DEBUGGING ONLY

}

/*********************************************************************
 * @fn      motorcontrol_registerCB
 *
 * @brief   When the motor controller sends the get register frame message
 *
 * @param   STM32MCP_rxMsg_t - The memory message to the received message, the size of the message is the second index rxMsg[1]
 *
 * @return  None.
 */
void motorcontrol_registerCB(simplePeripheral_bleCBs_t *obj)
{
    motorcontrol_bleCBs = obj;
}

/*********************************************************************
 * @fn      motorcontrol_processGetRegisterFrameMsg
 *
 * @brief   When the motor controller sends the get register frame message
 *
 * @param   STM32MCP_rxMsg_t - The memory message to the received message, the size of the message is the second index rxMsg[1]
 *
 * @return  None.
 */
static void motorcontrol_processGetRegisterFrameMsg(uint8_t *txPayload, uint8_t txPayloadLength, uint8_t *rxPayload, uint8_t rxPayloadLength)
{
    uint8_t regID = txPayload[0];
    switch(regID)
    {
    case STM32MCP_BUS_VOLTAGE_REG_ID:
        {
            uint16_t voltage_mV = *((uint16_t*) rxPayload) * 1000; // rxPayload in V, voltage in mV
        // **** store voltage_mV in (*ptrMCUDArray).voltage_mV
            (*ptrMCUDArray).voltage_mV = voltage_mV;

            break;
        }
    // *********  current sensor to be added to MCU.  Reserved case for current measurement
    case STM32MCP_TORQUE_MEASURED_REG_ID:
        {
        //keep current in mV - do not convert it to A
            uint16_t current_mA = *((uint8_t*) rxPayload) * 1000;
        // **** store current_mA in (*ptrMCUDArray).current_mV
            (*ptrMCUDArray).current_mA = 3000;//current_mA;
            break;
        }
    case STM32MCP_HEATSINK_TEMPERATURE_REG_ID:
        {
            int8_t heatSinkTemperature_Celcius = (int8_t) (*((uint8_t*) rxPayload) & 0xFF);     // temperature can be a negative value, unless it is in Kelvin
        // **** store heatSinkTemperature_Celcius in (*ptrMCUDArray).heatSinkTemperature_Celcius
            (*ptrMCUDArray).heatSinkTemperature_Celcius = 15;//heatSinkTemperature_Celcius;
            break;
        }
    case STM32MCP_SPEED_MEASURED_REG_ID:
        {
            uint16_t rpm;
            int32_t rawRPM = *((int32_t*) rxPayload);
            if(rawRPM >= 0)
            {
                rpm = (uint16_t) (rawRPM & 0xFFFF);
            }
            else  // **** what if rawRPM is negative??? e.g. pushing the E-scooter in reverse.  Then rawRPM would be negative!!!
            {
                rpm = (uint16_t) (-rawRPM & 0xFFFF);
            }
            // **** store rpm in (*ptrMCUDArray).speed_rpm
            (*ptrMCUDArray).speed_rpm = rpm;
            brakeAndThrottle_rpm = rpm;
            break;
        }
// ********************    Need to create new REG_IDs
    case STM32MCP_MOTOR_TEMPERATURE_REG_ID:
        {
            int8_t motorTemperature_Celcius = (int8_t) (*((uint8_t*) rxPayload) & 0xFF);     // temperature can be a negative value, unless it is in Kelvin

            (*ptrMCUDArray).motorTemperature_Celcius = 20;//motorTemperature_Celcius;

            break;
        }
    case STM32MCP_CONTROLLER_ERRORCODE_REG_ID:
        {

            //
            break;
        }
    default:
            break;
    }

}

/*********************************************************************
 * @fn      motorcontrol_dataAnalysis_sampling
 *
 * @brief   Pass motor sensor data to data analysis
 *
 * @param   x_hf - counts the number of high frequency periodic communication executions
 *
 * @return  None.
 */
void motorcontrol_dataAnalysis_sampling(uint8_t x_hf)
{
    (*ptrMCUDArray).count_hf = x_hf;
    dataAnalysis_sampling((*ptrMCUDArray).count_hf, (*ptrMCUDArray).voltage_mV, (*ptrMCUDArray).current_mA, (*ptrMCUDArray).speed_rpm,
                          (*ptrMCUDArray).heatSinkTemperature_Celcius, (*ptrMCUDArray).motorTemperature_Celcius);
}

/*********************************************************************
 * @fn      motorcontrol_rxMsgCb
 *
 * @brief   When the motor controller sends the feedback message back, it reaches here
 *
 * @param   rxMsg - The memory message to the received message, the size of the message is the second index rxMsg[1]
 *          motorID - The motor ID described in STM32MCP
 *          frameID - The frame ID described in STM32MCP
 *
 * @return  None.
 */
static void motorcontrol_rxMsgCb(uint8_t *rxMsg, STM32MCP_txMsgNode_t *STM32MCP_txMsgNode)
{
    uint8_t frameID = STM32MCP_txMsgNode->txMsg[0] & 0x1F;

    uint8_t rxPayloadLength = rxMsg[1];
    uint8_t *rxPayload = (uint8_t*)malloc(sizeof(uint8_t)*rxPayloadLength);
    memcpy(rxPayload, rxMsg + 2, rxPayloadLength);

    uint8_t txPayloadLength = STM32MCP_txMsgNode->size;
    uint8_t *txPayload = (uint8_t*)malloc(sizeof(uint8_t)*txPayloadLength);
    memcpy(txPayload, STM32MCP_txMsgNode->txMsg + 2, txPayloadLength);

    switch(frameID)
    {
    case STM32MCP_SET_REGISTER_FRAME_ID:
        break;
    case STM32MCP_GET_REGISTER_FRAME_ID:
        motorcontrol_processGetRegisterFrameMsg(txPayload, txPayloadLength, rxPayload, rxPayloadLength);
        break;
    case STM32MCP_EXECUTE_COMMAND_FRAME_ID:
        break;
    case STM32MCP_GET_BOARD_INFO_FRAME_ID:
        break;
    case STM32MCP_EXEC_RAMP_FRAME_ID:
        break;
    case STM32MCP_GET_REVUP_DATA_FRAME_ID:
        break;
    case STM32MCP_SET_REVUP_DATA_FRAME_ID:
        break;
    case STM32MCP_SET_CURRENT_REFERENCES_FRAME_ID:
        break;
    case STM32MCP_SET_SYSTEM_CONTROL_CONFIG_FRAME_ID:
        break;
    case STM32MCP_SET_DRIVE_MODE_CONFIG_FRAME_ID:
        break;
    case STM32MCP_SET_DYNAMIC_TORQUE_FRAME_ID:
        break;
    default:
        break;
    }
    free(rxPayload);
    free(txPayload);
}

/*********************************************************************
 * @fn      motorcontrol_exMsgCb
 *
 * @brief   When the motor controller sends the exception back, it reaches here
 *
 * @param   exceptionCode - The exception code described in STM32MCP
 *
 * @return  None.
 */
static void motorcontrol_exMsgCb(uint8_t exceptionCode)
{
    switch(exceptionCode)
        {
        case STM32MCP_QUEUE_OVERLOAD:
            break;
        case STM32MCP_EXCEED_MAXIMUM_RETRANSMISSION_ALLOWANCE:
            break;
        default:
            break;
        }
}

/*********************************************************************
 * @fn      motorcontrol_erMsgCb
 *
 * @brief   When the motor controller sends the error back, it reaches here
 *
 * @param   exceptionCode - The error code described in STM32MCP
 *
 * @return  None.
 */
static void motorcontrol_erMsgCb(uint8_t errorCode)
{
    switch(errorCode)
    {
    case STM32MCP_BAD_FRAME_ID:
        break;
    case STM32MCP_WRITE_ON_READ_ONLY:
        break;
    case STM32MCP_READ_NOT_ALLOWED:
        break;
    case STM32MCP_BAD_TARGET_DRIVE:
        break;
    case STM32MCP_OUT_OF_RANGE:
        break;
    case STM32MCP_BAD_COMMAND_ID:
        break;
    case STM32MCP_OVERRUN_ERROR:
        break;
    case STM32MCP_TIMEOUT_ERROR:
        break;
    case STM32MCP_BAD_CRC:
        break;
    default:
        break;
    }
}

/*********************************************************************
 * @fn      motorcontrol_brakeAndThrottleCB
 *
 * @brief   When the brake and throttle completed the adc conversion, it sends message here to communicate with STM32
 *
 * @param   throttlePercent - how much speed or torque in percentage the escooter should reach
 *          errorMsg - The error Msg
 *
 * @return  None.
 */
uint16_t execute_rpm;
//static void motorcontrol_brakeAndThrottleCB(uint16_t allowableSpeed, uint16_t IQValue, uint8_t errorMsg)
static void motorcontrol_brakeAndThrottleCB(uint16_t allowableSpeed, uint16_t IQValue, uint8_t errorMsg)
{
    if((errorMsg == BRAKE_AND_THROTTLE_NORMAL))
    {
        /*When driver accelerates / decelerates by twisting the throttle, the IQ signal with max. speed will be sent to the motor controller.
         * */
        STM32MCP_setDynamicCurrent(allowableSpeed, IQValue);

