GenevGitHub/simple_peripheral_cc2640r2lp_app-New-Version-/Application/motorControl.c
    }
    else
    {
        /*In case the brake and throttle are in malfunction, for safety, the E-Scooter stops operation. User
         *has to check the wire connections.
         *You have to ensure the wires are connected properly!
         * */
        //STM32MCP_executeCommandFrame(STM32MCP_MOTOR_1_ID, STM32MCP_STOP_MOTOR_COMMAND_ID);
        STM32MCP_setDynamicCurrent(allowableSpeed, 0);
        /*Sends Error Report to STM32 Motor Controller --> Transition to EMERGENCY STOP state*/
    }

}

/*********************************************************************
 * @fn      motorcontrol_speedModeChgCB
 *
 * @brief   When there is a speed mode change, it sends message here to communicate with STM32
 *
 * @param   speed mode parameters
 *
 *
 * @return  None.
 */
uint8_t motorcontrol_speedModeChgCount = 0;     // for debugging only
void motorcontrol_speedModeChgCB(uint16_t torqueIQ, uint16_t allowableSpeed, uint16_t rampRate)
{
    motorcontrol_speedModeChgCount++;           // for debugging only
    // send speed mode change parameters to motor control
    STM32MCP_setSpeedModeConfiguration(torqueIQ, allowableSpeed, rampRate);

}

/*********************************************************************
 * @fn      motorcontrol_controllerCB
 *
 * @brief   When the motor controller sends the error back, it reaches here
 *
 * @param   exceptionCode - The error code described in STM32MCP
 *
 * @return  None.
 */
static void motorcontrol_controllerCB(uint8_t paramID)
{
    switch(paramID)
    {
        case CONTROLLER_TOTAL_DISTANCE_TRAVELLED:
            {
                //Controller_GetParameter(CONTROLLER_TOTAL_DISTANCE_TRAVELLED, &Total_Distance_Travelled);
                break;
            }
        default:
            break;
    }
}
/*********************************************************************
 * @fn      motorcontrol_dashboardCB
 *
 * @brief   When the client (The mobile app) writes the Dashboard GATT server
 *          It will post the paramID of the changed characteristic, and Set the gatt due to client Callback
 *
 *          G-Link v1 allows the following characteristics to be changed from the client (mobile app)
 *          - light mode (paramID 3)
 *
 * @param   paramID: the paramID of the characteristics
 *
 * @return  TRUE or FALSE
 */
static void motorcontrol_dashboardCB(uint8_t paramID)
{
    switch(paramID)
    {
    case DASHBOARD_LIGHT_MODE: // whenever user tabs the light mode icon on the mobile app, motorcontrol_dashboardCB will toggle the light mode by calling lightControl_change()
        {
            uint8_t light_mode_temp = lightControl_lightModeChange();
            ledControl_setLightMode( light_mode_temp );
            break;
        }
    default:
        break;
    }
}
/*********************************************************************
 * @fn      motorcontrol_singleButtonCB
 * @brief   Set the gatt due to singleButton Callback
 *
 * @param   serviceUUID - the service UUID
 *          characteristics - the characteristics (Not UUID, just the index)
 *          payload - just the payload
 *
 * @return  TRUE or FALSE
 */
//uint8_t advertEnable = FALSE;
uint8_t messageid;              // for debugging only
/*Might be we have to create a state machine to monitor the power status! */
uint8_t peripheral_deactive = 0;
uint8_t CLS = 0x01;
static void motorcontrol_singleButtonCB(uint8_t messageID)
{
    messageid = messageID;  // for debugging only

    switch(messageID)
    {
    case SINGLE_BUTTON_SINGLE_LONG_PRESS_MSG:       // case = 0x01 - toggle Device Power ON / OFF
        {// toggle Power ON/OFF or Enter/Exit Sleep Mode
            // if Powering On -> switch to Power Off
            if(powerOn == 1){
                powerOn = 0;
                //  trigger Power Transition Notification, when Power Stage Transition is triggered, before shutting down, the
                //  system is jumped into powerTransitionNotifyFxn Function to doing the followings if the transition event is PowerCC26XX_ENTERING_SHUTDOWN:
                //  send power off command to motor controller
                //  Peripheral De-Initialization
                //  before enters low power mode.........
                //  1.turn off ADC
                //  2.turn off I2C
                //  3.turn off TSL2561
                //  4.turn off all tasks
                // At very last:
                // call nvs write to write into NVS memory only when power off - will take a few milliseconds to complete
                // 5.nvsControl_nvsWrite();
                // STM32MCP_setSystemControlConfigFrame(STM32MCP_POWER_OFF);
                // pinConfig = PINCC26XX_setWakeup(ExternalWakeUpPin);
                // Power_shutdown(0,0);
                /* Configure DIO for wake up from shutdown */
                //ACTIVATE();
                //if(CLS == 0x02)
                //{
                PWR_CTL(0x00);
                //}
                //bootSuccess = 0x01;
            }
            // if Powering Off -> switch to Power On
            if(powerOn == 0){
                //  system reset (Program Counter resets)
                //  wait for 1.5 seconds to power on
                //  call nvs read to read NVS memory - will take a few milliseconds to complete
                //  nvsControl_nvsRead();
                //  close NVS
                //  initialize ADC and turn On ADC
                //  initialize I2C
                //  initialize TSL2561
                //  turn ON tasks
                //  checks UART connection
                //  send power on command to motor controller
                //  System Reset
                powerOn = 1;
            }
        // ICallPlatform_pwrNotify(unsigned int eventType, uintptr_t eventArg, uintptr_t clientArg)
            break;
        }
    case SINGLE_BUTTON_SINGLE_SHORT_PRESS_MSG:      // case = 0x02 - toggle light modes
        {
            uint8_t light_mode_temp = lightControl_lightModeChange();

            ledControl_setLightMode( light_mode_temp );

            break;
        }
    case SINGLE_BUTTON_SINGLE_SHORT_LONG_PRESS_MSG: // case = 0x03 - ADVERT_ENABLE if BLE in waiting state or waiting after timeout state
        {
            if (motorControl_getGAPRole_taskCreate_flag == 1)
            {
                gaprole_States_t get_gaproleState;
                GAPRole_GetParameter(GAPROLE_STATE, &get_gaproleState);
                if((get_gaproleState == GAPROLE_WAITING) || (get_gaproleState == GAPROLE_WAITING_AFTER_TIMEOUT) || (get_gaproleState == GAPROLE_STARTED))
                {
                    uint8_t advertising = true;
                    GAPRole_SetParameter(GAPROLE_ADVERT_ENABLED, sizeof(uint8_t), &advertising);
                }
                brakeAndThrottle_gapRoleChg(1);

