GenevGitHub/simple_peripheral_cc2640r2lp_app-New-Version-/Application/motorControl.c
            }

            break;
        }
    case SINGLE_BUTTON_DOUBLE_SHORT_PRESS_MSG:      // case = 0x04 - toggle speed modes
        {
            uint8_t speedMode_temp = brakeAndThrottle_toggleSpeedMode(); // update speed mode displayed on dash board
            /* update speed mode displayed on dash board */
            ledControl_setSpeedMode(speedMode_temp);

            break;
        }
    case SINGLE_BUTTON_TREBLE_SHORT_PRESS_MSG:      // case = 0x05 - toggle units
        {
            uint8_t UnitSelectDash = dataAnalysis_getUnitSelectDash();
            if (UnitSelectDash == IMP_UNIT) {
                UnitSelectDash = SI_UNIT;
            }
            else if (UnitSelectDash == SI_UNIT) {
                UnitSelectDash = IMP_UNIT;
            }
            /* send UnitSelectDash to dataAnalysis.c */
            dataAnalysis_changeUnitSelectDash(UnitSelectDash);
            /* send UnitSelectDash to ledControl.c */
            ledControl_setUnitSelectDash(UnitSelectDash);
            break;
        }
    case SINGLE_BUTTON_QUADRUPLE_SHORT_PRESS_MSG:      // case = 0x06 - toggle control law
        {
            // toggles control law
            uint8_t currentControlLaw = brakeAndThrottle_getControlLaw();
            if (currentControlLaw == BRAKE_AND_THROTTLE_NORMALLAW){
                currentControlLaw = BRAKE_AND_THROTTLE_DIRECTLAW;
            }
            else if (currentControlLaw == BRAKE_AND_THROTTLE_DIRECTLAW){
                currentControlLaw = BRAKE_AND_THROTTLE_NORMALLAW;
            }
            /* send currentControlLaw to brakeAndThrotte.c */
            brakeAndThrottle_setControlLaw(currentControlLaw);
            break;
        }
    default:                                        // case 0x00 and all other cases
        break;
    }
}
/*********************************************************************
 * @fn      motorcontrol_setGatt
 * @brief   Set the gatt
 *
 * @param   serviceUUID - the service UUID
 *          characteristics - the characteristics (Not UUID, just the index)
 *          payloadLength - the length of the payload
 *          payload - just the payload
 *
 * @return  TRUE or FALSE <--- Nil (void)???
 */
void motorcontrol_setGatt(uint16_t serviceUUID, uint8_t charteristics, uint8_t payloadLength, uint8_t* payload)
{
    uint8_t *theMessage = ICall_malloc(sizeof(uint8_t)*(payloadLength + 4));
    if (theMessage)
    {
        theMessage[0] = (serviceUUID >> 0) & 0xFF;
        theMessage[1] = (serviceUUID >> 8) & 0xFF;
        theMessage[2] = charteristics;
        theMessage[3] = payloadLength;
        memcpy(theMessage + 4, payload, payloadLength);
        motorcontrol_bleCBs->enqueueMsg(SBP_MC_GATT_EVT, 0, theMessage);
    }
}
